'''Уровень: Сложный

Напишите функцию transform_string_to_integer, которая принимает на вход строку s - описание числа русскими словами.

На выходе функция должна возвращать число, которое описано в строке s.

Примечания:

Минимальное число - ноль (включительно)
Максимальное число - один миллион (включительно)
На вход подаются строки с описанием числа, проверять это не нужно
Пример 1:

Дано: 'один'
Результат: 1

Пример 2:

Дано: 'двадцать'
Результат: 20

Пример 3:

Дано: 'двести сорок шесть'
Результат: 246

Пример 4:

Дано: 'семьсот восемьдесят три тысячи девятьсот девятнадцать'
Результат: 783919'''